# Використовуємо офіційний образ Golang для створення артефакту побудови.
FROM golang:1.22 AS build

# Копіюємо локальний код до образу контейнера.
WORKDIR /app
COPY . .

# Виконуємо tidy для модулів Go
RUN go mod tidy

# Збираємо Go додаток
RUN go build -o main ./cmd/http/main.go

# Використовуємо мінімальний базовий образ для копіювання бінарного файлу.
FROM alpine:3.14

WORKDIR /root/

# Копіюємо попередньо побудований виконуваний файл з попереднього етапу.
COPY --from=build ./main .
# Встановлюємо дозвіл на виконання для файлу main.
RUN chmod +x main

# Вказуємо, що контейнер повинен слухати порт 8080
EXPOSE 8080

# Команда для запуску бінарного файлу.
CMD ["./main"]
